console.groupCollapsed("\n%c  %c考试时钟 ExamClock", "background:url('https://exam.cooo.site/logo_g_64.png') no-repeat;padding:32px;", "font:bold 36px sans-serif;color:#3a9;");
console.log("\n项目仓库：https://github.com/L33Z22L11/ExamClock\n野生技协群：894656456\n\n");
console.groupEnd();
/* 
 * 适用于宝鸡中学的考试科目列表
 */
today.gone22 = parseInt((Date.now() - new Date(2022, 5, 9)) / 864E5);
today.cee23 = parseInt((new Date(2023, 5, 8) - Date.now()) / 864E5);
exam["2022-05-14"] = function () {
  slogan.$main = today.cee22 + "天后 峰顶相会";
  $("晚修", today.date, "22:30", "23:30");
  return today.date + "临时";
};
exam[22] = function () {
  slogan.$main = "出舱" + today.gone22 + "天 感觉良好";
  subject.$admit = 2;
  // 这种情况就比较复杂了，代码和人有一个能跑就行
  // 特别注意，最后一轮求余后应该是数组第0项
  if (!today.day) {
    // 周日白天
  }
  // 非周日的白天
  if (today.day != 6) {
  }
  if (today.day == 6) {
  } else {
  }
  if (today.day != 6) {
    // 非周六的晚上
  }
  return "高三日常";
};
exam[23] = function () {
  slogan.$main = "距离高考" + today.cee23 + "天";
  subject.$admit = 2;
  // 夏季作息时间，上午竟然要上五节课
  $("晨读1", today.date, "07:05", "07:20");
  $("晨会", today.date, "07:20", "07:25");
  $("晨读2", today.date, "07:25", "07:45");
  $("第1节", today.date, "07:55", "08:35");
  $("第2节", today.date, "08:45", "09:25");
  $("课间操", today.date, "09:25", "09:50", "<a href='https://mp.weixin.qq.com/s/61Voi3s4tFtAup2-eOg1Lg'><i class='fa-regular fa-circle-play'></i> 点击播放高清室内操", ["《鳌拜鳌拜鳌拜拜》(原曲《Batte Forte》)《夜空中最亮的星》《虫儿飞》"]);
  $("第3节", today.date, "09:50", "10:30");
  $("第4节", today.date, "10:40", "11:20");
  $("第5节", today.date, "11:30", "12:10");
  $("第6节", today.date, "14:25", "15:05", null, null, 5);
  $("第7节", today.date, "15:15", "15:55");
  $("第8节", today.date, "16:10", "16:50", null, null, 7);
  $("自习", today.date, "17:00", "18:00");
  $("晚写", today.date, "19:05", "19:15", null, null, 5);
  $("晚一", today.date, "19:15", "19:55");
  $("晚二", today.date, "20:05", "20:45");
  $("晚三", today.date, "21:00", "22:30", null, null, 7);
  // $("晚修", today.date, "22:20", "23:20");
  return "高三日常";
}
exam[231] = function () {
  slogan.$sub = ["高三月考一(理科)：请以实际铃声为准。"];
  subject.$admit = 20;
  $("数学", "2022-10-08", "14:00", "16:00");
  $("英语", "2022-10-08", "16:30", "18:30");
  $("语文", "2022-10-09", "07:50", "10:20");
  $("化学", "2022-10-09", "10:50", "12:30");
  $("生物", "2022-10-09", "14:00", "15:40");
  $("物理", "2022-10-09", "16:10", "17:50");
  return "高三理科";
};
exam[232] = function () {
  slogan.$sub = ["高三月考一(文科)：请以实际铃声为准。"];
  subject.$admit = 20;
  $("数学", "2022-10-08", "14:00", "16:00");
  $("英语", "2022-10-08", "16:30", "18:30");
  $("语文", "2022-10-09", "07:50", "10:20");
  $("地理", "2022-10-09", "10:50", "12:30");
  $("历史", "2022-10-09", "14:00", "15:40");
  $("政治", "2022-10-09", "16:10", "17:50");
  return "高三文科";
};
exam[241] = function () {
  slogan.$sub = ["高二诊断性考试(理科)：请以实际铃声为准。"];
  subject.$admit = 20;
  $("语文", "2022-08-26", "07:40", "10:10");
  $("物理", "2022-08-26", "10:40", "12:20");
  $("数学", "2022-08-26", "14:20", "16:20");
  $("化学", "2022-08-26", "16:50", "18:30");
  $("英语", "2022-08-27", "07:50", "09:50");
  $("生物", "2022-08-27", "10:20", "12:00");
  return "高二理科";
};
exam[242] = function () {
  slogan.$sub = ["高二诊断性考试(文科)：请以实际铃声为准。"];
  subject.$admit = 20;
  $("语文", "2022-08-26", "07:40", "10:10");
  $("历史", "2022-08-26", "10:40", "12:20");
  $("数学", "2022-08-26", "14:20", "16:20");
  $("地理", "2022-08-26", "16:50", "18:30");
  $("英语", "2022-08-27", "07:50", "09:50");
  $("政治", "2022-08-27", "10:20", "12:00");
  return "高二文科";
};
